; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_1 type_3)
 (:predicates (pred_3 ?v5 - type_1 ?v4 - type_2)
 	      (pred_1 ?v2 - object ?v4 - type_2)
	      (pred_4 ?v5 - type_1 ?v8 - type_3)
	      (pred_2 ?v5 - type_1 ?v2 - object ?v8 - type_3))

   (:action op_1
       :parameters  (?v5 - type_1 ?v1 ?v7 - type_2)
       :precondition (and  (pred_3 ?v5 ?v1))
       :effect (and  (pred_3 ?v5 ?v7)
		     (not (pred_3 ?v5 ?v1))))

   (:action op_2
       :parameters (?v5 - type_1 ?v3 - object ?v6 - type_2 ?v8 - type_3)
       :precondition  (and  (pred_1 ?v3 ?v6) (pred_3 ?v5 ?v6) (pred_4 ?v5 ?v8))
       :effect (and (pred_2 ?v5 ?v3 ?v8)
		    (not (pred_1 ?v3 ?v6)) 
		    (not (pred_4 ?v5 ?v8))))

   (:action op_3
       :parameters (?v5 - type_1 ?v3 - object ?v6 - type_2 ?v8 - type_3)
       :precondition  (and  (pred_2 ?v5 ?v3 ?v8) (pred_3 ?v5 ?v6))
       :effect (and (pred_1 ?v3 ?v6)
		    (pred_4 ?v5 ?v8)
		    (not (pred_2 ?v5 ?v3 ?v8)))))

; problem
(define (problem gripper-2-3-2)
(:domain gripper-strips)
(:objects obj_05 obj_04 - type_1
obj_11 obj_01 obj_10 obj_03 - type_3
obj_02 obj_08 obj_06 - type_2
obj_09 obj_07 - object)
(:init
(pred_3 obj_05 obj_02)
(pred_4 obj_05 obj_11)
(pred_4 obj_05 obj_01)
(pred_3 obj_04 obj_06)
(pred_4 obj_04 obj_10)
(pred_4 obj_04 obj_03)
(pred_1 obj_09 obj_06)
(pred_1 obj_07 obj_06)
)
(:goal
(and
(pred_1 obj_09 obj_02)
(pred_1 obj_07 obj_08)
)
)

(:constraints
  (and
    (always (not (and (pred_3 obj_05 obj_02) (pred_3 obj_04 obj_02))))
  )
)
)

; plan
1. (op_2 obj_04 obj_09 obj_06 obj_03)
   deleted: (pred_1 obj_09 obj_06) (pred_4 obj_04 obj_03)
   added: (pred_2 obj_04 obj_09 obj_03)
   goals met: 0 of 2
2. (op_2 obj_04 obj_07 obj_06 obj_10)
   deleted: (pred_1 obj_07 obj_06) (pred_4 obj_04 obj_10)
   added: (pred_2 obj_04 obj_07 obj_10)
   goals met: 0 of 2
3. (op_1 obj_05 obj_02 obj_08)
   deleted: (pred_3 obj_05 obj_02)
   added: (pred_3 obj_05 obj_08)
   goals met: 0 of 2
4. (op_1 obj_04 obj_06 obj_08)
   deleted: (pred_3 obj_04 obj_06)
   added: (pred_3 obj_04 obj_08)
   goals met: 0 of 2
5. (op_3 obj_04 obj_07 obj_08 obj_10)
   deleted: (pred_2 obj_04 obj_07 obj_10)
   added: (pred_1 obj_07 obj_08) (pred_4 obj_04 obj_10)
   goals met: 1 of 2
6. (op_1 obj_04 obj_08 obj_02)
   deleted: (pred_3 obj_04 obj_08)
   added: (pred_3 obj_04 obj_02)
   goals met: 1 of 2
7. (op_3 obj_04 obj_09 obj_02 obj_03)
   deleted: (pred_2 obj_04 obj_09 obj_03)
   added: (pred_1 obj_09 obj_02) (pred_4 obj_04 obj_03)
   goals met: 2 of 2
